Docs/Reference/Content/images/dependencies/net8.0/d2/alloverit-aws-appsync-client.d2
direction: left

aoi: AllOverIt
aoi.alloverit-aws-appsync-client: AllOverIt.Aws.AppSync.Client
microsoft-extensions-dependencyinjection_9-0-17: Microsoft.Extensions.DependencyInjection\nv9.0.17
microsoft-extensions-dependencyinjection-abstractions_9-0-17: Microsoft.Extensions.DependencyInjection.Abstractions\nv9.0.17
microsoft-extensions-http_9-0-17: Microsoft.Extensions.Http\nv9.0.17
microsoft-extensions-configuration-abstractions_9-0-17: Microsoft.Extensions.Configuration.Abstractions\nv9.0.17
microsoft-extensions-diagnostics_9-0-17: Microsoft.Extensions.Diagnostics\nv9.0.17
microsoft-extensions-logging_9-0-17: Microsoft.Extensions.Logging\nv9.0.17
microsoft-extensions-logging-abstractions_9-0-17: Microsoft.Extensions.Logging.Abstractions\nv9.0.17
microsoft-extensions-options_9-0-17: Microsoft.Extensions.Options\nv9.0.17
aoi.alloverit-reactive: AllOverIt.Reactive
system-reactive_6-1-0: System.Reactive\nv6.1.0
aoi.alloverit: AllOverIt
aoi.alloverit-assertion: AllOverIt.Assertion
aoi.alloverit-serialization-json-abstractions: AllOverIt.Serialization.Json.Abstractions
microsoft-extensions-dependencyinjection_9-0-17 <- aoi.alloverit-aws-appsync-client
microsoft-extensions-dependencyinjection-abstractions_9-0-17 <- microsoft-extensions-dependencyinjection_9-0-17
microsoft-extensions-http_9-0-17 <- aoi.alloverit-aws-appsync-client
microsoft-extensions-configuration-abstractions_9-0-17 <- microsoft-extensions-http_9-0-17
microsoft-extensions-dependencyinjection-abstractions_9-0-17 <- microsoft-extensions-http_9-0-17
microsoft-extensions-diagnostics_9-0-17 <- microsoft-extensions-http_9-0-17
microsoft-extensions-logging_9-0-17 <- microsoft-extensions-http_9-0-17
microsoft-extensions-logging-abstractions_9-0-17 <- microsoft-extensions-http_9-0-17
microsoft-extensions-options_9-0-17 <- microsoft-extensions-http_9-0-17
aoi.alloverit-reactive <- aoi.alloverit-aws-appsync-client
system-reactive_6-1-0 <- aoi.alloverit-reactive
aoi.alloverit <- aoi.alloverit-reactive
aoi.alloverit-assertion <- aoi.alloverit
aoi.alloverit-serialization-json-abstractions <- aoi.alloverit-aws-appsync-client
aoi.alloverit <- aoi.alloverit-serialization-json-abstractions
microsoft-extensions-dependencyinjection_9-0-17.style.fill: "#ADD8E6"
microsoft-extensions-dependencyinjection_9-0-17.style.opacity: 0.8
microsoft-extensions-dependencyinjection-abstractions_9-0-17.style.fill: "#FFEC96"
microsoft-extensions-dependencyinjection-abstractions_9-0-17.style.opacity: 0.8
microsoft-extensions-http_9-0-17.style.fill: "#ADD8E6"
microsoft-extensions-http_9-0-17.style.opacity: 0.8
microsoft-extensions-configuration-abstractions_9-0-17.style.fill: "#FFEC96"
microsoft-extensions-configuration-abstractions_9-0-17.style.opacity: 0.8
microsoft-extensions-diagnostics_9-0-17.style.fill: "#FFEC96"
microsoft-extensions-diagnostics_9-0-17.style.opacity: 0.8
microsoft-extensions-logging_9-0-17.style.fill: "#FFEC96"
microsoft-extensions-logging_9-0-17.style.opacity: 0.8
microsoft-extensions-logging-abstractions_9-0-17.style.fill: "#FFEC96"
microsoft-extensions-logging-abstractions_9-0-17.style.opacity: 0.8
microsoft-extensions-options_9-0-17.style.fill: "#FFEC96"
microsoft-extensions-options_9-0-17.style.opacity: 0.8
system-reactive_6-1-0.style.fill: "#ADD8E6"
system-reactive_6-1-0.style.opacity: 0.8
aoi.style.fill: "#E7EBFC"
aoi.style.opacity: 1
